# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSheetSet..::..Name Property
ViewSheetSet Class See Also
---
The view sheet set name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override string Name { get; set; }
```

Visual Basic
---
```text
Public Overrides Property Name As String
	Get
	Set
```

Visual C++
---
```text
public:
virtual property String^ Name {
	String^ get () override;
	void set (String^ value) override;
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when trying to set the name. Instead, set the name with the Rename(String) method. |

# See Also
ViewSheetSet Class
Autodesk.Revit.DB Namespace